Revit 2027 API
BuiltInFailures.ViewFailures.InsertComponentViewError Property
 This type of Component cannot be placed in Elevation or Section view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InsertComponentViewError { get; }
Public Shared ReadOnly Property InsertComponentViewError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InsertComponentViewError {
	FailureDefinitionId^ get ();
}
static member InsertComponentViewError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace